Seeed-Studio/ArduPy/ports/samd/boards/xiao/mpconfigboard.h
// options to control how MicroPython is built
#define MICROPY_HW_BOARD_NAME               "Ardupy"
#define MICROPY_HW_MCU_NAME                 "seeed"
#define MICROPY_PY_SYS_PLATFORM             "Atmel SAMD21"
#define ARDUPY_FULL_BUILD                   (0)
#define MICROPY_USE_INTERNAL_PRINTF         (1)
#define MICROPY_EMIT_THUMB                  (0)
#define MICROPY_EMIT_INLINE_THUMB           (0)
#define MICROPY_PY_COLLECTIONS_ORDEREDDICT  (0)




